<?php

use Illuminate\Database\Seeder;

class FacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'id' => 1,
                'name' => 'Будівельний факультет',
            ],
            [
                'id' => 2,
                'name' => 'Факультет комп\'ютеризованих технологій машинобудування та дизайну',
            ],
            [
                'id' => 3,
                'name' => 'Факультет електронних технологій і робототехніки',
            ],
            [
                'id' => 4,
                'name' => 'Факультет харчових технологій та сфери обслуговування',
            ],
            [
                'id' => 5,
                'name' => 'Факультет економіки та управління',
            ],
            [
                'id' => 6,
                'name' => 'Факультет інформаційних технологій і систем',
            ],
            [
                'id' => 7,
                'name' => 'Факультет гуманітарних технологій',
            ]
        ];
        DB::table('faculties')->insert($data);
    }
}
