<?php

use Illuminate\Database\Seeder;

class GroupSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [];

        $all_groups = [
            ['ЕК-73', 'ЕК-83', 'ЕК-93', 'ЕКск-193', 'ХТ-74', 'ХТ-84', 'ХТ-94', 'Б-71', 'Б-81', 'Б-91',
                'Бск-191', 'ГЗ-72', 'ГЗ-82', 'ГЗ-92', 'ГЗск-192', 'ЛГ-95', 'МГЕК-903', 'МГХТ-904', 'МГХТ-905', 'МГБ-902', 'МГБ-901'],
            ['ДЗ-72', 'ДЗ-74', 'ДЗ-71А', 'ДЗ-72ск', 'ДЗ-71Бск', 'ДЗ-71Аск', 'ДЗ-82', 'ДЗ-83', 'ДЗ-81Б', 'ДЗ-93',
                'ДЗ-94', 'ДЗ-91А', 'ДЗ-91Б', 'ДЗ-92', 'ПМ-71', 'ПМ-71ск', 'ПМ-81', 'ПМ-91', 'ПМО-89', 'ГМ-92',
                'МВ-72', 'ПВ-72', 'МВ-72ск', 'ПВ-72ск', 'ТЕ-78', 'ТЕ-78ск', 'ТЕ-98', 'ВПС-75', 'ВПС-75ск', 'АВ-73',
                'АВ-73ск', 'АВ-83', 'АВ-93', 'ТТ-74', 'ТТ-74ск', 'ТТ-84', 'мДЗ-52', 'мДЗ-53', 'мДЗ-51Б', 'мДЗ-51А',
                'мТМ-51', 'мНТ-52', 'мМВ-55', 'мПВ-56', 'мТЕ-58', 'мАВ-53', 'мТТ-54', 'ТЕ-88'],
            ['БІ-91', 'ЕСЕ-92', 'РС-93', 'РТ-95', 'БІ-81', 'ЕСЕ-82', 'РС-83', 'РТ-86', 'БІ-71ск',
                'СКЕСЕ-96', 'П-73ск', 'М-74ск', 'МП-75ск', 'СКРТ-97', 'ТК-76ск', 'БІ-71', 'ЕСЕ-72', 'П-73', 'М-74',
                'МП-75', 'ТК-76', 'БІ-091', 'ЕСЕ-092', 'РС-093', 'М-094', 'РТ-095', 'ТК-096'],
            ['Т-71', 'ГРС-72', 'ТБВ-74', 'І-75', 'ГРС-61', 'ГРС-62', 'Т-63', 'ТХП-64', 'ГРС-56', 'ГРС-57',
                'Т-58', 'ТБВ–54', 'Т-44', 'ГРС-45', 'ТБВ-45', 'ТБВм-77', 'МТ-76'],
            ['МЕ-193', 'БО-192', 'М-195', 'МК-197', 'ЕП-194', 'ПУА-198', 'МЕ-183', 'БО-182', 'ЕП-184', 'М-185',
                'МК-187', 'ПУА-188', 'ЕК-176', 'БО-172', 'ФК-171', 'ЕП-174', 'ПУА-178', 'МЕСК-173', 'БОСК-172',
                'ФКСК-171', 'МСК-175', 'МКСК-177', 'ЕПСК-174', 'ЕКМ-019', 'МЕМ-019', 'БОМ-019', 'ФКМ-019', 'УІДМ-019', 'ММ-019',
                'МКМ-019', 'ЕПМ-019', 'ПУАМ-019'],
            ['DS-1910', 'ПЗ-1904', 'КН-1901', 'СКС-1907', 'СП-1906', 'АКІТ-1909', 'СКС-187', 'СА-182', 'Web-1811', 'ПЗ-174',
                'КН-171', 'СКС-177', 'КМ-175', 'БІУ-178', 'АКІТ-177', 'ПЗС-1944', 'WEBC-1911', 'АКІТС-1999', 'МПЗ-1904', 'МКТ-1901',
                'МІТ-1910', 'МКМ-1905', 'МСКС-1907', 'МСП-1906', 'МСА-1902', 'МАКІТ-1909'],
            ['І-85', 'І-95', 'ІМ-019', 'ПФ-179', 'ПФ-189', 'ПФ-199', 'ПФМ-019', 'ПЛ-71', 'НП-75', 'ПЛ-81',
                'НП-85', 'ПЛ-91', 'МПЛ-51', 'МНП-55', 'ПР-96', 'СЗ-1710', 'СЗ-1810', 'СЗ-1910', 'СЗСК-1710', 'СЗМ-019']
        ];

        foreach ($all_groups as $index => $groups) {
            foreach ($groups as $group) {
                $group_data = [
                    'faculty_id' => $index + 1,
                    'name' => $group,
                ];

                array_push($data, $group_data);
            }
        }

        DB::table('groups')->insert($data);
    }
}
